Revit 2026 API

# ModelPath Methods

---

The ModelPath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares this ModelPath with another |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModelGUID | A GUID identifying the Revit cloud model. |
|  | GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ModelPath Class

Autodesk.Revit.DB Namespace